###################################################################

# Created by write_sdc on Wed Apr 15 17:50:32 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clka]
set_driving_cell -lib_cell INVX1 [get_ports clkb]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_driving_cell -lib_cell INVX1 [get_ports player_left_input]
set_driving_cell -lib_cell INVX1 [get_ports player_right_input]
set_driving_cell -lib_cell INVX1 [get_ports player_shoot_input]
create_clock [get_ports clka]  -period 20  -waveform {0 10}
set_input_delay -clock clka  1  [get_ports clkb]
set_input_delay -clock clka  1  [get_ports reset]
set_input_delay -clock clka  1  [get_ports player_left_input]
set_input_delay -clock clka  1  [get_ports player_right_input]
set_input_delay -clock clka  1  [get_ports player_shoot_input]
set_output_delay -clock clka  1  [get_ports {display_flat[1023]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1022]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1021]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1020]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1019]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1018]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1017]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1016]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1015]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1014]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1013]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1012]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1011]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1010]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1009]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1008]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1007]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1006]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1005]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1004]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1003]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1002]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1001]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1000]}]
set_output_delay -clock clka  1  [get_ports {display_flat[999]}]
set_output_delay -clock clka  1  [get_ports {display_flat[998]}]
set_output_delay -clock clka  1  [get_ports {display_flat[997]}]
set_output_delay -clock clka  1  [get_ports {display_flat[996]}]
set_output_delay -clock clka  1  [get_ports {display_flat[995]}]
set_output_delay -clock clka  1  [get_ports {display_flat[994]}]
set_output_delay -clock clka  1  [get_ports {display_flat[993]}]
set_output_delay -clock clka  1  [get_ports {display_flat[992]}]
set_output_delay -clock clka  1  [get_ports {display_flat[991]}]
set_output_delay -clock clka  1  [get_ports {display_flat[990]}]
set_output_delay -clock clka  1  [get_ports {display_flat[989]}]
set_output_delay -clock clka  1  [get_ports {display_flat[988]}]
set_output_delay -clock clka  1  [get_ports {display_flat[987]}]
set_output_delay -clock clka  1  [get_ports {display_flat[986]}]
set_output_delay -clock clka  1  [get_ports {display_flat[985]}]
set_output_delay -clock clka  1  [get_ports {display_flat[984]}]
set_output_delay -clock clka  1  [get_ports {display_flat[983]}]
set_output_delay -clock clka  1  [get_ports {display_flat[982]}]
set_output_delay -clock clka  1  [get_ports {display_flat[981]}]
set_output_delay -clock clka  1  [get_ports {display_flat[980]}]
set_output_delay -clock clka  1  [get_ports {display_flat[979]}]
set_output_delay -clock clka  1  [get_ports {display_flat[978]}]
set_output_delay -clock clka  1  [get_ports {display_flat[977]}]
set_output_delay -clock clka  1  [get_ports {display_flat[976]}]
set_output_delay -clock clka  1  [get_ports {display_flat[975]}]
set_output_delay -clock clka  1  [get_ports {display_flat[974]}]
set_output_delay -clock clka  1  [get_ports {display_flat[973]}]
set_output_delay -clock clka  1  [get_ports {display_flat[972]}]
set_output_delay -clock clka  1  [get_ports {display_flat[971]}]
set_output_delay -clock clka  1  [get_ports {display_flat[970]}]
set_output_delay -clock clka  1  [get_ports {display_flat[969]}]
set_output_delay -clock clka  1  [get_ports {display_flat[968]}]
set_output_delay -clock clka  1  [get_ports {display_flat[967]}]
set_output_delay -clock clka  1  [get_ports {display_flat[966]}]
set_output_delay -clock clka  1  [get_ports {display_flat[965]}]
set_output_delay -clock clka  1  [get_ports {display_flat[964]}]
set_output_delay -clock clka  1  [get_ports {display_flat[963]}]
set_output_delay -clock clka  1  [get_ports {display_flat[962]}]
set_output_delay -clock clka  1  [get_ports {display_flat[961]}]
set_output_delay -clock clka  1  [get_ports {display_flat[960]}]
set_output_delay -clock clka  1  [get_ports {display_flat[959]}]
set_output_delay -clock clka  1  [get_ports {display_flat[958]}]
set_output_delay -clock clka  1  [get_ports {display_flat[957]}]
set_output_delay -clock clka  1  [get_ports {display_flat[956]}]
set_output_delay -clock clka  1  [get_ports {display_flat[955]}]
set_output_delay -clock clka  1  [get_ports {display_flat[954]}]
set_output_delay -clock clka  1  [get_ports {display_flat[953]}]
set_output_delay -clock clka  1  [get_ports {display_flat[952]}]
set_output_delay -clock clka  1  [get_ports {display_flat[951]}]
set_output_delay -clock clka  1  [get_ports {display_flat[950]}]
set_output_delay -clock clka  1  [get_ports {display_flat[949]}]
set_output_delay -clock clka  1  [get_ports {display_flat[948]}]
set_output_delay -clock clka  1  [get_ports {display_flat[947]}]
set_output_delay -clock clka  1  [get_ports {display_flat[946]}]
set_output_delay -clock clka  1  [get_ports {display_flat[945]}]
set_output_delay -clock clka  1  [get_ports {display_flat[944]}]
set_output_delay -clock clka  1  [get_ports {display_flat[943]}]
set_output_delay -clock clka  1  [get_ports {display_flat[942]}]
set_output_delay -clock clka  1  [get_ports {display_flat[941]}]
set_output_delay -clock clka  1  [get_ports {display_flat[940]}]
set_output_delay -clock clka  1  [get_ports {display_flat[939]}]
set_output_delay -clock clka  1  [get_ports {display_flat[938]}]
set_output_delay -clock clka  1  [get_ports {display_flat[937]}]
set_output_delay -clock clka  1  [get_ports {display_flat[936]}]
set_output_delay -clock clka  1  [get_ports {display_flat[935]}]
set_output_delay -clock clka  1  [get_ports {display_flat[934]}]
set_output_delay -clock clka  1  [get_ports {display_flat[933]}]
set_output_delay -clock clka  1  [get_ports {display_flat[932]}]
set_output_delay -clock clka  1  [get_ports {display_flat[931]}]
set_output_delay -clock clka  1  [get_ports {display_flat[930]}]
set_output_delay -clock clka  1  [get_ports {display_flat[929]}]
set_output_delay -clock clka  1  [get_ports {display_flat[928]}]
set_output_delay -clock clka  1  [get_ports {display_flat[927]}]
set_output_delay -clock clka  1  [get_ports {display_flat[926]}]
set_output_delay -clock clka  1  [get_ports {display_flat[925]}]
set_output_delay -clock clka  1  [get_ports {display_flat[924]}]
set_output_delay -clock clka  1  [get_ports {display_flat[923]}]
set_output_delay -clock clka  1  [get_ports {display_flat[922]}]
set_output_delay -clock clka  1  [get_ports {display_flat[921]}]
set_output_delay -clock clka  1  [get_ports {display_flat[920]}]
set_output_delay -clock clka  1  [get_ports {display_flat[919]}]
set_output_delay -clock clka  1  [get_ports {display_flat[918]}]
set_output_delay -clock clka  1  [get_ports {display_flat[917]}]
set_output_delay -clock clka  1  [get_ports {display_flat[916]}]
set_output_delay -clock clka  1  [get_ports {display_flat[915]}]
set_output_delay -clock clka  1  [get_ports {display_flat[914]}]
set_output_delay -clock clka  1  [get_ports {display_flat[913]}]
set_output_delay -clock clka  1  [get_ports {display_flat[912]}]
set_output_delay -clock clka  1  [get_ports {display_flat[911]}]
set_output_delay -clock clka  1  [get_ports {display_flat[910]}]
set_output_delay -clock clka  1  [get_ports {display_flat[909]}]
set_output_delay -clock clka  1  [get_ports {display_flat[908]}]
set_output_delay -clock clka  1  [get_ports {display_flat[907]}]
set_output_delay -clock clka  1  [get_ports {display_flat[906]}]
set_output_delay -clock clka  1  [get_ports {display_flat[905]}]
set_output_delay -clock clka  1  [get_ports {display_flat[904]}]
set_output_delay -clock clka  1  [get_ports {display_flat[903]}]
set_output_delay -clock clka  1  [get_ports {display_flat[902]}]
set_output_delay -clock clka  1  [get_ports {display_flat[901]}]
set_output_delay -clock clka  1  [get_ports {display_flat[900]}]
set_output_delay -clock clka  1  [get_ports {display_flat[899]}]
set_output_delay -clock clka  1  [get_ports {display_flat[898]}]
set_output_delay -clock clka  1  [get_ports {display_flat[897]}]
set_output_delay -clock clka  1  [get_ports {display_flat[896]}]
set_output_delay -clock clka  1  [get_ports {display_flat[895]}]
set_output_delay -clock clka  1  [get_ports {display_flat[894]}]
set_output_delay -clock clka  1  [get_ports {display_flat[893]}]
set_output_delay -clock clka  1  [get_ports {display_flat[892]}]
set_output_delay -clock clka  1  [get_ports {display_flat[891]}]
set_output_delay -clock clka  1  [get_ports {display_flat[890]}]
set_output_delay -clock clka  1  [get_ports {display_flat[889]}]
set_output_delay -clock clka  1  [get_ports {display_flat[888]}]
set_output_delay -clock clka  1  [get_ports {display_flat[887]}]
set_output_delay -clock clka  1  [get_ports {display_flat[886]}]
set_output_delay -clock clka  1  [get_ports {display_flat[885]}]
set_output_delay -clock clka  1  [get_ports {display_flat[884]}]
set_output_delay -clock clka  1  [get_ports {display_flat[883]}]
set_output_delay -clock clka  1  [get_ports {display_flat[882]}]
set_output_delay -clock clka  1  [get_ports {display_flat[881]}]
set_output_delay -clock clka  1  [get_ports {display_flat[880]}]
set_output_delay -clock clka  1  [get_ports {display_flat[879]}]
set_output_delay -clock clka  1  [get_ports {display_flat[878]}]
set_output_delay -clock clka  1  [get_ports {display_flat[877]}]
set_output_delay -clock clka  1  [get_ports {display_flat[876]}]
set_output_delay -clock clka  1  [get_ports {display_flat[875]}]
set_output_delay -clock clka  1  [get_ports {display_flat[874]}]
set_output_delay -clock clka  1  [get_ports {display_flat[873]}]
set_output_delay -clock clka  1  [get_ports {display_flat[872]}]
set_output_delay -clock clka  1  [get_ports {display_flat[871]}]
set_output_delay -clock clka  1  [get_ports {display_flat[870]}]
set_output_delay -clock clka  1  [get_ports {display_flat[869]}]
set_output_delay -clock clka  1  [get_ports {display_flat[868]}]
set_output_delay -clock clka  1  [get_ports {display_flat[867]}]
set_output_delay -clock clka  1  [get_ports {display_flat[866]}]
set_output_delay -clock clka  1  [get_ports {display_flat[865]}]
set_output_delay -clock clka  1  [get_ports {display_flat[864]}]
set_output_delay -clock clka  1  [get_ports {display_flat[863]}]
set_output_delay -clock clka  1  [get_ports {display_flat[862]}]
set_output_delay -clock clka  1  [get_ports {display_flat[861]}]
set_output_delay -clock clka  1  [get_ports {display_flat[860]}]
set_output_delay -clock clka  1  [get_ports {display_flat[859]}]
set_output_delay -clock clka  1  [get_ports {display_flat[858]}]
set_output_delay -clock clka  1  [get_ports {display_flat[857]}]
set_output_delay -clock clka  1  [get_ports {display_flat[856]}]
set_output_delay -clock clka  1  [get_ports {display_flat[855]}]
set_output_delay -clock clka  1  [get_ports {display_flat[854]}]
set_output_delay -clock clka  1  [get_ports {display_flat[853]}]
set_output_delay -clock clka  1  [get_ports {display_flat[852]}]
set_output_delay -clock clka  1  [get_ports {display_flat[851]}]
set_output_delay -clock clka  1  [get_ports {display_flat[850]}]
set_output_delay -clock clka  1  [get_ports {display_flat[849]}]
set_output_delay -clock clka  1  [get_ports {display_flat[848]}]
set_output_delay -clock clka  1  [get_ports {display_flat[847]}]
set_output_delay -clock clka  1  [get_ports {display_flat[846]}]
set_output_delay -clock clka  1  [get_ports {display_flat[845]}]
set_output_delay -clock clka  1  [get_ports {display_flat[844]}]
set_output_delay -clock clka  1  [get_ports {display_flat[843]}]
set_output_delay -clock clka  1  [get_ports {display_flat[842]}]
set_output_delay -clock clka  1  [get_ports {display_flat[841]}]
set_output_delay -clock clka  1  [get_ports {display_flat[840]}]
set_output_delay -clock clka  1  [get_ports {display_flat[839]}]
set_output_delay -clock clka  1  [get_ports {display_flat[838]}]
set_output_delay -clock clka  1  [get_ports {display_flat[837]}]
set_output_delay -clock clka  1  [get_ports {display_flat[836]}]
set_output_delay -clock clka  1  [get_ports {display_flat[835]}]
set_output_delay -clock clka  1  [get_ports {display_flat[834]}]
set_output_delay -clock clka  1  [get_ports {display_flat[833]}]
set_output_delay -clock clka  1  [get_ports {display_flat[832]}]
set_output_delay -clock clka  1  [get_ports {display_flat[831]}]
set_output_delay -clock clka  1  [get_ports {display_flat[830]}]
set_output_delay -clock clka  1  [get_ports {display_flat[829]}]
set_output_delay -clock clka  1  [get_ports {display_flat[828]}]
set_output_delay -clock clka  1  [get_ports {display_flat[827]}]
set_output_delay -clock clka  1  [get_ports {display_flat[826]}]
set_output_delay -clock clka  1  [get_ports {display_flat[825]}]
set_output_delay -clock clka  1  [get_ports {display_flat[824]}]
set_output_delay -clock clka  1  [get_ports {display_flat[823]}]
set_output_delay -clock clka  1  [get_ports {display_flat[822]}]
set_output_delay -clock clka  1  [get_ports {display_flat[821]}]
set_output_delay -clock clka  1  [get_ports {display_flat[820]}]
set_output_delay -clock clka  1  [get_ports {display_flat[819]}]
set_output_delay -clock clka  1  [get_ports {display_flat[818]}]
set_output_delay -clock clka  1  [get_ports {display_flat[817]}]
set_output_delay -clock clka  1  [get_ports {display_flat[816]}]
set_output_delay -clock clka  1  [get_ports {display_flat[815]}]
set_output_delay -clock clka  1  [get_ports {display_flat[814]}]
set_output_delay -clock clka  1  [get_ports {display_flat[813]}]
set_output_delay -clock clka  1  [get_ports {display_flat[812]}]
set_output_delay -clock clka  1  [get_ports {display_flat[811]}]
set_output_delay -clock clka  1  [get_ports {display_flat[810]}]
set_output_delay -clock clka  1  [get_ports {display_flat[809]}]
set_output_delay -clock clka  1  [get_ports {display_flat[808]}]
set_output_delay -clock clka  1  [get_ports {display_flat[807]}]
set_output_delay -clock clka  1  [get_ports {display_flat[806]}]
set_output_delay -clock clka  1  [get_ports {display_flat[805]}]
set_output_delay -clock clka  1  [get_ports {display_flat[804]}]
set_output_delay -clock clka  1  [get_ports {display_flat[803]}]
set_output_delay -clock clka  1  [get_ports {display_flat[802]}]
set_output_delay -clock clka  1  [get_ports {display_flat[801]}]
set_output_delay -clock clka  1  [get_ports {display_flat[800]}]
set_output_delay -clock clka  1  [get_ports {display_flat[799]}]
set_output_delay -clock clka  1  [get_ports {display_flat[798]}]
set_output_delay -clock clka  1  [get_ports {display_flat[797]}]
set_output_delay -clock clka  1  [get_ports {display_flat[796]}]
set_output_delay -clock clka  1  [get_ports {display_flat[795]}]
set_output_delay -clock clka  1  [get_ports {display_flat[794]}]
set_output_delay -clock clka  1  [get_ports {display_flat[793]}]
set_output_delay -clock clka  1  [get_ports {display_flat[792]}]
set_output_delay -clock clka  1  [get_ports {display_flat[791]}]
set_output_delay -clock clka  1  [get_ports {display_flat[790]}]
set_output_delay -clock clka  1  [get_ports {display_flat[789]}]
set_output_delay -clock clka  1  [get_ports {display_flat[788]}]
set_output_delay -clock clka  1  [get_ports {display_flat[787]}]
set_output_delay -clock clka  1  [get_ports {display_flat[786]}]
set_output_delay -clock clka  1  [get_ports {display_flat[785]}]
set_output_delay -clock clka  1  [get_ports {display_flat[784]}]
set_output_delay -clock clka  1  [get_ports {display_flat[783]}]
set_output_delay -clock clka  1  [get_ports {display_flat[782]}]
set_output_delay -clock clka  1  [get_ports {display_flat[781]}]
set_output_delay -clock clka  1  [get_ports {display_flat[780]}]
set_output_delay -clock clka  1  [get_ports {display_flat[779]}]
set_output_delay -clock clka  1  [get_ports {display_flat[778]}]
set_output_delay -clock clka  1  [get_ports {display_flat[777]}]
set_output_delay -clock clka  1  [get_ports {display_flat[776]}]
set_output_delay -clock clka  1  [get_ports {display_flat[775]}]
set_output_delay -clock clka  1  [get_ports {display_flat[774]}]
set_output_delay -clock clka  1  [get_ports {display_flat[773]}]
set_output_delay -clock clka  1  [get_ports {display_flat[772]}]
set_output_delay -clock clka  1  [get_ports {display_flat[771]}]
set_output_delay -clock clka  1  [get_ports {display_flat[770]}]
set_output_delay -clock clka  1  [get_ports {display_flat[769]}]
set_output_delay -clock clka  1  [get_ports {display_flat[768]}]
set_output_delay -clock clka  1  [get_ports {display_flat[767]}]
set_output_delay -clock clka  1  [get_ports {display_flat[766]}]
set_output_delay -clock clka  1  [get_ports {display_flat[765]}]
set_output_delay -clock clka  1  [get_ports {display_flat[764]}]
set_output_delay -clock clka  1  [get_ports {display_flat[763]}]
set_output_delay -clock clka  1  [get_ports {display_flat[762]}]
set_output_delay -clock clka  1  [get_ports {display_flat[761]}]
set_output_delay -clock clka  1  [get_ports {display_flat[760]}]
set_output_delay -clock clka  1  [get_ports {display_flat[759]}]
set_output_delay -clock clka  1  [get_ports {display_flat[758]}]
set_output_delay -clock clka  1  [get_ports {display_flat[757]}]
set_output_delay -clock clka  1  [get_ports {display_flat[756]}]
set_output_delay -clock clka  1  [get_ports {display_flat[755]}]
set_output_delay -clock clka  1  [get_ports {display_flat[754]}]
set_output_delay -clock clka  1  [get_ports {display_flat[753]}]
set_output_delay -clock clka  1  [get_ports {display_flat[752]}]
set_output_delay -clock clka  1  [get_ports {display_flat[751]}]
set_output_delay -clock clka  1  [get_ports {display_flat[750]}]
set_output_delay -clock clka  1  [get_ports {display_flat[749]}]
set_output_delay -clock clka  1  [get_ports {display_flat[748]}]
set_output_delay -clock clka  1  [get_ports {display_flat[747]}]
set_output_delay -clock clka  1  [get_ports {display_flat[746]}]
set_output_delay -clock clka  1  [get_ports {display_flat[745]}]
set_output_delay -clock clka  1  [get_ports {display_flat[744]}]
set_output_delay -clock clka  1  [get_ports {display_flat[743]}]
set_output_delay -clock clka  1  [get_ports {display_flat[742]}]
set_output_delay -clock clka  1  [get_ports {display_flat[741]}]
set_output_delay -clock clka  1  [get_ports {display_flat[740]}]
set_output_delay -clock clka  1  [get_ports {display_flat[739]}]
set_output_delay -clock clka  1  [get_ports {display_flat[738]}]
set_output_delay -clock clka  1  [get_ports {display_flat[737]}]
set_output_delay -clock clka  1  [get_ports {display_flat[736]}]
set_output_delay -clock clka  1  [get_ports {display_flat[735]}]
set_output_delay -clock clka  1  [get_ports {display_flat[734]}]
set_output_delay -clock clka  1  [get_ports {display_flat[733]}]
set_output_delay -clock clka  1  [get_ports {display_flat[732]}]
set_output_delay -clock clka  1  [get_ports {display_flat[731]}]
set_output_delay -clock clka  1  [get_ports {display_flat[730]}]
set_output_delay -clock clka  1  [get_ports {display_flat[729]}]
set_output_delay -clock clka  1  [get_ports {display_flat[728]}]
set_output_delay -clock clka  1  [get_ports {display_flat[727]}]
set_output_delay -clock clka  1  [get_ports {display_flat[726]}]
set_output_delay -clock clka  1  [get_ports {display_flat[725]}]
set_output_delay -clock clka  1  [get_ports {display_flat[724]}]
set_output_delay -clock clka  1  [get_ports {display_flat[723]}]
set_output_delay -clock clka  1  [get_ports {display_flat[722]}]
set_output_delay -clock clka  1  [get_ports {display_flat[721]}]
set_output_delay -clock clka  1  [get_ports {display_flat[720]}]
set_output_delay -clock clka  1  [get_ports {display_flat[719]}]
set_output_delay -clock clka  1  [get_ports {display_flat[718]}]
set_output_delay -clock clka  1  [get_ports {display_flat[717]}]
set_output_delay -clock clka  1  [get_ports {display_flat[716]}]
set_output_delay -clock clka  1  [get_ports {display_flat[715]}]
set_output_delay -clock clka  1  [get_ports {display_flat[714]}]
set_output_delay -clock clka  1  [get_ports {display_flat[713]}]
set_output_delay -clock clka  1  [get_ports {display_flat[712]}]
set_output_delay -clock clka  1  [get_ports {display_flat[711]}]
set_output_delay -clock clka  1  [get_ports {display_flat[710]}]
set_output_delay -clock clka  1  [get_ports {display_flat[709]}]
set_output_delay -clock clka  1  [get_ports {display_flat[708]}]
set_output_delay -clock clka  1  [get_ports {display_flat[707]}]
set_output_delay -clock clka  1  [get_ports {display_flat[706]}]
set_output_delay -clock clka  1  [get_ports {display_flat[705]}]
set_output_delay -clock clka  1  [get_ports {display_flat[704]}]
set_output_delay -clock clka  1  [get_ports {display_flat[703]}]
set_output_delay -clock clka  1  [get_ports {display_flat[702]}]
set_output_delay -clock clka  1  [get_ports {display_flat[701]}]
set_output_delay -clock clka  1  [get_ports {display_flat[700]}]
set_output_delay -clock clka  1  [get_ports {display_flat[699]}]
set_output_delay -clock clka  1  [get_ports {display_flat[698]}]
set_output_delay -clock clka  1  [get_ports {display_flat[697]}]
set_output_delay -clock clka  1  [get_ports {display_flat[696]}]
set_output_delay -clock clka  1  [get_ports {display_flat[695]}]
set_output_delay -clock clka  1  [get_ports {display_flat[694]}]
set_output_delay -clock clka  1  [get_ports {display_flat[693]}]
set_output_delay -clock clka  1  [get_ports {display_flat[692]}]
set_output_delay -clock clka  1  [get_ports {display_flat[691]}]
set_output_delay -clock clka  1  [get_ports {display_flat[690]}]
set_output_delay -clock clka  1  [get_ports {display_flat[689]}]
set_output_delay -clock clka  1  [get_ports {display_flat[688]}]
set_output_delay -clock clka  1  [get_ports {display_flat[687]}]
set_output_delay -clock clka  1  [get_ports {display_flat[686]}]
set_output_delay -clock clka  1  [get_ports {display_flat[685]}]
set_output_delay -clock clka  1  [get_ports {display_flat[684]}]
set_output_delay -clock clka  1  [get_ports {display_flat[683]}]
set_output_delay -clock clka  1  [get_ports {display_flat[682]}]
set_output_delay -clock clka  1  [get_ports {display_flat[681]}]
set_output_delay -clock clka  1  [get_ports {display_flat[680]}]
set_output_delay -clock clka  1  [get_ports {display_flat[679]}]
set_output_delay -clock clka  1  [get_ports {display_flat[678]}]
set_output_delay -clock clka  1  [get_ports {display_flat[677]}]
set_output_delay -clock clka  1  [get_ports {display_flat[676]}]
set_output_delay -clock clka  1  [get_ports {display_flat[675]}]
set_output_delay -clock clka  1  [get_ports {display_flat[674]}]
set_output_delay -clock clka  1  [get_ports {display_flat[673]}]
set_output_delay -clock clka  1  [get_ports {display_flat[672]}]
set_output_delay -clock clka  1  [get_ports {display_flat[671]}]
set_output_delay -clock clka  1  [get_ports {display_flat[670]}]
set_output_delay -clock clka  1  [get_ports {display_flat[669]}]
set_output_delay -clock clka  1  [get_ports {display_flat[668]}]
set_output_delay -clock clka  1  [get_ports {display_flat[667]}]
set_output_delay -clock clka  1  [get_ports {display_flat[666]}]
set_output_delay -clock clka  1  [get_ports {display_flat[665]}]
set_output_delay -clock clka  1  [get_ports {display_flat[664]}]
set_output_delay -clock clka  1  [get_ports {display_flat[663]}]
set_output_delay -clock clka  1  [get_ports {display_flat[662]}]
set_output_delay -clock clka  1  [get_ports {display_flat[661]}]
set_output_delay -clock clka  1  [get_ports {display_flat[660]}]
set_output_delay -clock clka  1  [get_ports {display_flat[659]}]
set_output_delay -clock clka  1  [get_ports {display_flat[658]}]
set_output_delay -clock clka  1  [get_ports {display_flat[657]}]
set_output_delay -clock clka  1  [get_ports {display_flat[656]}]
set_output_delay -clock clka  1  [get_ports {display_flat[655]}]
set_output_delay -clock clka  1  [get_ports {display_flat[654]}]
set_output_delay -clock clka  1  [get_ports {display_flat[653]}]
set_output_delay -clock clka  1  [get_ports {display_flat[652]}]
set_output_delay -clock clka  1  [get_ports {display_flat[651]}]
set_output_delay -clock clka  1  [get_ports {display_flat[650]}]
set_output_delay -clock clka  1  [get_ports {display_flat[649]}]
set_output_delay -clock clka  1  [get_ports {display_flat[648]}]
set_output_delay -clock clka  1  [get_ports {display_flat[647]}]
set_output_delay -clock clka  1  [get_ports {display_flat[646]}]
set_output_delay -clock clka  1  [get_ports {display_flat[645]}]
set_output_delay -clock clka  1  [get_ports {display_flat[644]}]
set_output_delay -clock clka  1  [get_ports {display_flat[643]}]
set_output_delay -clock clka  1  [get_ports {display_flat[642]}]
set_output_delay -clock clka  1  [get_ports {display_flat[641]}]
set_output_delay -clock clka  1  [get_ports {display_flat[640]}]
set_output_delay -clock clka  1  [get_ports {display_flat[639]}]
set_output_delay -clock clka  1  [get_ports {display_flat[638]}]
set_output_delay -clock clka  1  [get_ports {display_flat[637]}]
set_output_delay -clock clka  1  [get_ports {display_flat[636]}]
set_output_delay -clock clka  1  [get_ports {display_flat[635]}]
set_output_delay -clock clka  1  [get_ports {display_flat[634]}]
set_output_delay -clock clka  1  [get_ports {display_flat[633]}]
set_output_delay -clock clka  1  [get_ports {display_flat[632]}]
set_output_delay -clock clka  1  [get_ports {display_flat[631]}]
set_output_delay -clock clka  1  [get_ports {display_flat[630]}]
set_output_delay -clock clka  1  [get_ports {display_flat[629]}]
set_output_delay -clock clka  1  [get_ports {display_flat[628]}]
set_output_delay -clock clka  1  [get_ports {display_flat[627]}]
set_output_delay -clock clka  1  [get_ports {display_flat[626]}]
set_output_delay -clock clka  1  [get_ports {display_flat[625]}]
set_output_delay -clock clka  1  [get_ports {display_flat[624]}]
set_output_delay -clock clka  1  [get_ports {display_flat[623]}]
set_output_delay -clock clka  1  [get_ports {display_flat[622]}]
set_output_delay -clock clka  1  [get_ports {display_flat[621]}]
set_output_delay -clock clka  1  [get_ports {display_flat[620]}]
set_output_delay -clock clka  1  [get_ports {display_flat[619]}]
set_output_delay -clock clka  1  [get_ports {display_flat[618]}]
set_output_delay -clock clka  1  [get_ports {display_flat[617]}]
set_output_delay -clock clka  1  [get_ports {display_flat[616]}]
set_output_delay -clock clka  1  [get_ports {display_flat[615]}]
set_output_delay -clock clka  1  [get_ports {display_flat[614]}]
set_output_delay -clock clka  1  [get_ports {display_flat[613]}]
set_output_delay -clock clka  1  [get_ports {display_flat[612]}]
set_output_delay -clock clka  1  [get_ports {display_flat[611]}]
set_output_delay -clock clka  1  [get_ports {display_flat[610]}]
set_output_delay -clock clka  1  [get_ports {display_flat[609]}]
set_output_delay -clock clka  1  [get_ports {display_flat[608]}]
set_output_delay -clock clka  1  [get_ports {display_flat[607]}]
set_output_delay -clock clka  1  [get_ports {display_flat[606]}]
set_output_delay -clock clka  1  [get_ports {display_flat[605]}]
set_output_delay -clock clka  1  [get_ports {display_flat[604]}]
set_output_delay -clock clka  1  [get_ports {display_flat[603]}]
set_output_delay -clock clka  1  [get_ports {display_flat[602]}]
set_output_delay -clock clka  1  [get_ports {display_flat[601]}]
set_output_delay -clock clka  1  [get_ports {display_flat[600]}]
set_output_delay -clock clka  1  [get_ports {display_flat[599]}]
set_output_delay -clock clka  1  [get_ports {display_flat[598]}]
set_output_delay -clock clka  1  [get_ports {display_flat[597]}]
set_output_delay -clock clka  1  [get_ports {display_flat[596]}]
set_output_delay -clock clka  1  [get_ports {display_flat[595]}]
set_output_delay -clock clka  1  [get_ports {display_flat[594]}]
set_output_delay -clock clka  1  [get_ports {display_flat[593]}]
set_output_delay -clock clka  1  [get_ports {display_flat[592]}]
set_output_delay -clock clka  1  [get_ports {display_flat[591]}]
set_output_delay -clock clka  1  [get_ports {display_flat[590]}]
set_output_delay -clock clka  1  [get_ports {display_flat[589]}]
set_output_delay -clock clka  1  [get_ports {display_flat[588]}]
set_output_delay -clock clka  1  [get_ports {display_flat[587]}]
set_output_delay -clock clka  1  [get_ports {display_flat[586]}]
set_output_delay -clock clka  1  [get_ports {display_flat[585]}]
set_output_delay -clock clka  1  [get_ports {display_flat[584]}]
set_output_delay -clock clka  1  [get_ports {display_flat[583]}]
set_output_delay -clock clka  1  [get_ports {display_flat[582]}]
set_output_delay -clock clka  1  [get_ports {display_flat[581]}]
set_output_delay -clock clka  1  [get_ports {display_flat[580]}]
set_output_delay -clock clka  1  [get_ports {display_flat[579]}]
set_output_delay -clock clka  1  [get_ports {display_flat[578]}]
set_output_delay -clock clka  1  [get_ports {display_flat[577]}]
set_output_delay -clock clka  1  [get_ports {display_flat[576]}]
set_output_delay -clock clka  1  [get_ports {display_flat[575]}]
set_output_delay -clock clka  1  [get_ports {display_flat[574]}]
set_output_delay -clock clka  1  [get_ports {display_flat[573]}]
set_output_delay -clock clka  1  [get_ports {display_flat[572]}]
set_output_delay -clock clka  1  [get_ports {display_flat[571]}]
set_output_delay -clock clka  1  [get_ports {display_flat[570]}]
set_output_delay -clock clka  1  [get_ports {display_flat[569]}]
set_output_delay -clock clka  1  [get_ports {display_flat[568]}]
set_output_delay -clock clka  1  [get_ports {display_flat[567]}]
set_output_delay -clock clka  1  [get_ports {display_flat[566]}]
set_output_delay -clock clka  1  [get_ports {display_flat[565]}]
set_output_delay -clock clka  1  [get_ports {display_flat[564]}]
set_output_delay -clock clka  1  [get_ports {display_flat[563]}]
set_output_delay -clock clka  1  [get_ports {display_flat[562]}]
set_output_delay -clock clka  1  [get_ports {display_flat[561]}]
set_output_delay -clock clka  1  [get_ports {display_flat[560]}]
set_output_delay -clock clka  1  [get_ports {display_flat[559]}]
set_output_delay -clock clka  1  [get_ports {display_flat[558]}]
set_output_delay -clock clka  1  [get_ports {display_flat[557]}]
set_output_delay -clock clka  1  [get_ports {display_flat[556]}]
set_output_delay -clock clka  1  [get_ports {display_flat[555]}]
set_output_delay -clock clka  1  [get_ports {display_flat[554]}]
set_output_delay -clock clka  1  [get_ports {display_flat[553]}]
set_output_delay -clock clka  1  [get_ports {display_flat[552]}]
set_output_delay -clock clka  1  [get_ports {display_flat[551]}]
set_output_delay -clock clka  1  [get_ports {display_flat[550]}]
set_output_delay -clock clka  1  [get_ports {display_flat[549]}]
set_output_delay -clock clka  1  [get_ports {display_flat[548]}]
set_output_delay -clock clka  1  [get_ports {display_flat[547]}]
set_output_delay -clock clka  1  [get_ports {display_flat[546]}]
set_output_delay -clock clka  1  [get_ports {display_flat[545]}]
set_output_delay -clock clka  1  [get_ports {display_flat[544]}]
set_output_delay -clock clka  1  [get_ports {display_flat[543]}]
set_output_delay -clock clka  1  [get_ports {display_flat[542]}]
set_output_delay -clock clka  1  [get_ports {display_flat[541]}]
set_output_delay -clock clka  1  [get_ports {display_flat[540]}]
set_output_delay -clock clka  1  [get_ports {display_flat[539]}]
set_output_delay -clock clka  1  [get_ports {display_flat[538]}]
set_output_delay -clock clka  1  [get_ports {display_flat[537]}]
set_output_delay -clock clka  1  [get_ports {display_flat[536]}]
set_output_delay -clock clka  1  [get_ports {display_flat[535]}]
set_output_delay -clock clka  1  [get_ports {display_flat[534]}]
set_output_delay -clock clka  1  [get_ports {display_flat[533]}]
set_output_delay -clock clka  1  [get_ports {display_flat[532]}]
set_output_delay -clock clka  1  [get_ports {display_flat[531]}]
set_output_delay -clock clka  1  [get_ports {display_flat[530]}]
set_output_delay -clock clka  1  [get_ports {display_flat[529]}]
set_output_delay -clock clka  1  [get_ports {display_flat[528]}]
set_output_delay -clock clka  1  [get_ports {display_flat[527]}]
set_output_delay -clock clka  1  [get_ports {display_flat[526]}]
set_output_delay -clock clka  1  [get_ports {display_flat[525]}]
set_output_delay -clock clka  1  [get_ports {display_flat[524]}]
set_output_delay -clock clka  1  [get_ports {display_flat[523]}]
set_output_delay -clock clka  1  [get_ports {display_flat[522]}]
set_output_delay -clock clka  1  [get_ports {display_flat[521]}]
set_output_delay -clock clka  1  [get_ports {display_flat[520]}]
set_output_delay -clock clka  1  [get_ports {display_flat[519]}]
set_output_delay -clock clka  1  [get_ports {display_flat[518]}]
set_output_delay -clock clka  1  [get_ports {display_flat[517]}]
set_output_delay -clock clka  1  [get_ports {display_flat[516]}]
set_output_delay -clock clka  1  [get_ports {display_flat[515]}]
set_output_delay -clock clka  1  [get_ports {display_flat[514]}]
set_output_delay -clock clka  1  [get_ports {display_flat[513]}]
set_output_delay -clock clka  1  [get_ports {display_flat[512]}]
set_output_delay -clock clka  1  [get_ports {display_flat[511]}]
set_output_delay -clock clka  1  [get_ports {display_flat[510]}]
set_output_delay -clock clka  1  [get_ports {display_flat[509]}]
set_output_delay -clock clka  1  [get_ports {display_flat[508]}]
set_output_delay -clock clka  1  [get_ports {display_flat[507]}]
set_output_delay -clock clka  1  [get_ports {display_flat[506]}]
set_output_delay -clock clka  1  [get_ports {display_flat[505]}]
set_output_delay -clock clka  1  [get_ports {display_flat[504]}]
set_output_delay -clock clka  1  [get_ports {display_flat[503]}]
set_output_delay -clock clka  1  [get_ports {display_flat[502]}]
set_output_delay -clock clka  1  [get_ports {display_flat[501]}]
set_output_delay -clock clka  1  [get_ports {display_flat[500]}]
set_output_delay -clock clka  1  [get_ports {display_flat[499]}]
set_output_delay -clock clka  1  [get_ports {display_flat[498]}]
set_output_delay -clock clka  1  [get_ports {display_flat[497]}]
set_output_delay -clock clka  1  [get_ports {display_flat[496]}]
set_output_delay -clock clka  1  [get_ports {display_flat[495]}]
set_output_delay -clock clka  1  [get_ports {display_flat[494]}]
set_output_delay -clock clka  1  [get_ports {display_flat[493]}]
set_output_delay -clock clka  1  [get_ports {display_flat[492]}]
set_output_delay -clock clka  1  [get_ports {display_flat[491]}]
set_output_delay -clock clka  1  [get_ports {display_flat[490]}]
set_output_delay -clock clka  1  [get_ports {display_flat[489]}]
set_output_delay -clock clka  1  [get_ports {display_flat[488]}]
set_output_delay -clock clka  1  [get_ports {display_flat[487]}]
set_output_delay -clock clka  1  [get_ports {display_flat[486]}]
set_output_delay -clock clka  1  [get_ports {display_flat[485]}]
set_output_delay -clock clka  1  [get_ports {display_flat[484]}]
set_output_delay -clock clka  1  [get_ports {display_flat[483]}]
set_output_delay -clock clka  1  [get_ports {display_flat[482]}]
set_output_delay -clock clka  1  [get_ports {display_flat[481]}]
set_output_delay -clock clka  1  [get_ports {display_flat[480]}]
set_output_delay -clock clka  1  [get_ports {display_flat[479]}]
set_output_delay -clock clka  1  [get_ports {display_flat[478]}]
set_output_delay -clock clka  1  [get_ports {display_flat[477]}]
set_output_delay -clock clka  1  [get_ports {display_flat[476]}]
set_output_delay -clock clka  1  [get_ports {display_flat[475]}]
set_output_delay -clock clka  1  [get_ports {display_flat[474]}]
set_output_delay -clock clka  1  [get_ports {display_flat[473]}]
set_output_delay -clock clka  1  [get_ports {display_flat[472]}]
set_output_delay -clock clka  1  [get_ports {display_flat[471]}]
set_output_delay -clock clka  1  [get_ports {display_flat[470]}]
set_output_delay -clock clka  1  [get_ports {display_flat[469]}]
set_output_delay -clock clka  1  [get_ports {display_flat[468]}]
set_output_delay -clock clka  1  [get_ports {display_flat[467]}]
set_output_delay -clock clka  1  [get_ports {display_flat[466]}]
set_output_delay -clock clka  1  [get_ports {display_flat[465]}]
set_output_delay -clock clka  1  [get_ports {display_flat[464]}]
set_output_delay -clock clka  1  [get_ports {display_flat[463]}]
set_output_delay -clock clka  1  [get_ports {display_flat[462]}]
set_output_delay -clock clka  1  [get_ports {display_flat[461]}]
set_output_delay -clock clka  1  [get_ports {display_flat[460]}]
set_output_delay -clock clka  1  [get_ports {display_flat[459]}]
set_output_delay -clock clka  1  [get_ports {display_flat[458]}]
set_output_delay -clock clka  1  [get_ports {display_flat[457]}]
set_output_delay -clock clka  1  [get_ports {display_flat[456]}]
set_output_delay -clock clka  1  [get_ports {display_flat[455]}]
set_output_delay -clock clka  1  [get_ports {display_flat[454]}]
set_output_delay -clock clka  1  [get_ports {display_flat[453]}]
set_output_delay -clock clka  1  [get_ports {display_flat[452]}]
set_output_delay -clock clka  1  [get_ports {display_flat[451]}]
set_output_delay -clock clka  1  [get_ports {display_flat[450]}]
set_output_delay -clock clka  1  [get_ports {display_flat[449]}]
set_output_delay -clock clka  1  [get_ports {display_flat[448]}]
set_output_delay -clock clka  1  [get_ports {display_flat[447]}]
set_output_delay -clock clka  1  [get_ports {display_flat[446]}]
set_output_delay -clock clka  1  [get_ports {display_flat[445]}]
set_output_delay -clock clka  1  [get_ports {display_flat[444]}]
set_output_delay -clock clka  1  [get_ports {display_flat[443]}]
set_output_delay -clock clka  1  [get_ports {display_flat[442]}]
set_output_delay -clock clka  1  [get_ports {display_flat[441]}]
set_output_delay -clock clka  1  [get_ports {display_flat[440]}]
set_output_delay -clock clka  1  [get_ports {display_flat[439]}]
set_output_delay -clock clka  1  [get_ports {display_flat[438]}]
set_output_delay -clock clka  1  [get_ports {display_flat[437]}]
set_output_delay -clock clka  1  [get_ports {display_flat[436]}]
set_output_delay -clock clka  1  [get_ports {display_flat[435]}]
set_output_delay -clock clka  1  [get_ports {display_flat[434]}]
set_output_delay -clock clka  1  [get_ports {display_flat[433]}]
set_output_delay -clock clka  1  [get_ports {display_flat[432]}]
set_output_delay -clock clka  1  [get_ports {display_flat[431]}]
set_output_delay -clock clka  1  [get_ports {display_flat[430]}]
set_output_delay -clock clka  1  [get_ports {display_flat[429]}]
set_output_delay -clock clka  1  [get_ports {display_flat[428]}]
set_output_delay -clock clka  1  [get_ports {display_flat[427]}]
set_output_delay -clock clka  1  [get_ports {display_flat[426]}]
set_output_delay -clock clka  1  [get_ports {display_flat[425]}]
set_output_delay -clock clka  1  [get_ports {display_flat[424]}]
set_output_delay -clock clka  1  [get_ports {display_flat[423]}]
set_output_delay -clock clka  1  [get_ports {display_flat[422]}]
set_output_delay -clock clka  1  [get_ports {display_flat[421]}]
set_output_delay -clock clka  1  [get_ports {display_flat[420]}]
set_output_delay -clock clka  1  [get_ports {display_flat[419]}]
set_output_delay -clock clka  1  [get_ports {display_flat[418]}]
set_output_delay -clock clka  1  [get_ports {display_flat[417]}]
set_output_delay -clock clka  1  [get_ports {display_flat[416]}]
set_output_delay -clock clka  1  [get_ports {display_flat[415]}]
set_output_delay -clock clka  1  [get_ports {display_flat[414]}]
set_output_delay -clock clka  1  [get_ports {display_flat[413]}]
set_output_delay -clock clka  1  [get_ports {display_flat[412]}]
set_output_delay -clock clka  1  [get_ports {display_flat[411]}]
set_output_delay -clock clka  1  [get_ports {display_flat[410]}]
set_output_delay -clock clka  1  [get_ports {display_flat[409]}]
set_output_delay -clock clka  1  [get_ports {display_flat[408]}]
set_output_delay -clock clka  1  [get_ports {display_flat[407]}]
set_output_delay -clock clka  1  [get_ports {display_flat[406]}]
set_output_delay -clock clka  1  [get_ports {display_flat[405]}]
set_output_delay -clock clka  1  [get_ports {display_flat[404]}]
set_output_delay -clock clka  1  [get_ports {display_flat[403]}]
set_output_delay -clock clka  1  [get_ports {display_flat[402]}]
set_output_delay -clock clka  1  [get_ports {display_flat[401]}]
set_output_delay -clock clka  1  [get_ports {display_flat[400]}]
set_output_delay -clock clka  1  [get_ports {display_flat[399]}]
set_output_delay -clock clka  1  [get_ports {display_flat[398]}]
set_output_delay -clock clka  1  [get_ports {display_flat[397]}]
set_output_delay -clock clka  1  [get_ports {display_flat[396]}]
set_output_delay -clock clka  1  [get_ports {display_flat[395]}]
set_output_delay -clock clka  1  [get_ports {display_flat[394]}]
set_output_delay -clock clka  1  [get_ports {display_flat[393]}]
set_output_delay -clock clka  1  [get_ports {display_flat[392]}]
set_output_delay -clock clka  1  [get_ports {display_flat[391]}]
set_output_delay -clock clka  1  [get_ports {display_flat[390]}]
set_output_delay -clock clka  1  [get_ports {display_flat[389]}]
set_output_delay -clock clka  1  [get_ports {display_flat[388]}]
set_output_delay -clock clka  1  [get_ports {display_flat[387]}]
set_output_delay -clock clka  1  [get_ports {display_flat[386]}]
set_output_delay -clock clka  1  [get_ports {display_flat[385]}]
set_output_delay -clock clka  1  [get_ports {display_flat[384]}]
set_output_delay -clock clka  1  [get_ports {display_flat[383]}]
set_output_delay -clock clka  1  [get_ports {display_flat[382]}]
set_output_delay -clock clka  1  [get_ports {display_flat[381]}]
set_output_delay -clock clka  1  [get_ports {display_flat[380]}]
set_output_delay -clock clka  1  [get_ports {display_flat[379]}]
set_output_delay -clock clka  1  [get_ports {display_flat[378]}]
set_output_delay -clock clka  1  [get_ports {display_flat[377]}]
set_output_delay -clock clka  1  [get_ports {display_flat[376]}]
set_output_delay -clock clka  1  [get_ports {display_flat[375]}]
set_output_delay -clock clka  1  [get_ports {display_flat[374]}]
set_output_delay -clock clka  1  [get_ports {display_flat[373]}]
set_output_delay -clock clka  1  [get_ports {display_flat[372]}]
set_output_delay -clock clka  1  [get_ports {display_flat[371]}]
set_output_delay -clock clka  1  [get_ports {display_flat[370]}]
set_output_delay -clock clka  1  [get_ports {display_flat[369]}]
set_output_delay -clock clka  1  [get_ports {display_flat[368]}]
set_output_delay -clock clka  1  [get_ports {display_flat[367]}]
set_output_delay -clock clka  1  [get_ports {display_flat[366]}]
set_output_delay -clock clka  1  [get_ports {display_flat[365]}]
set_output_delay -clock clka  1  [get_ports {display_flat[364]}]
set_output_delay -clock clka  1  [get_ports {display_flat[363]}]
set_output_delay -clock clka  1  [get_ports {display_flat[362]}]
set_output_delay -clock clka  1  [get_ports {display_flat[361]}]
set_output_delay -clock clka  1  [get_ports {display_flat[360]}]
set_output_delay -clock clka  1  [get_ports {display_flat[359]}]
set_output_delay -clock clka  1  [get_ports {display_flat[358]}]
set_output_delay -clock clka  1  [get_ports {display_flat[357]}]
set_output_delay -clock clka  1  [get_ports {display_flat[356]}]
set_output_delay -clock clka  1  [get_ports {display_flat[355]}]
set_output_delay -clock clka  1  [get_ports {display_flat[354]}]
set_output_delay -clock clka  1  [get_ports {display_flat[353]}]
set_output_delay -clock clka  1  [get_ports {display_flat[352]}]
set_output_delay -clock clka  1  [get_ports {display_flat[351]}]
set_output_delay -clock clka  1  [get_ports {display_flat[350]}]
set_output_delay -clock clka  1  [get_ports {display_flat[349]}]
set_output_delay -clock clka  1  [get_ports {display_flat[348]}]
set_output_delay -clock clka  1  [get_ports {display_flat[347]}]
set_output_delay -clock clka  1  [get_ports {display_flat[346]}]
set_output_delay -clock clka  1  [get_ports {display_flat[345]}]
set_output_delay -clock clka  1  [get_ports {display_flat[344]}]
set_output_delay -clock clka  1  [get_ports {display_flat[343]}]
set_output_delay -clock clka  1  [get_ports {display_flat[342]}]
set_output_delay -clock clka  1  [get_ports {display_flat[341]}]
set_output_delay -clock clka  1  [get_ports {display_flat[340]}]
set_output_delay -clock clka  1  [get_ports {display_flat[339]}]
set_output_delay -clock clka  1  [get_ports {display_flat[338]}]
set_output_delay -clock clka  1  [get_ports {display_flat[337]}]
set_output_delay -clock clka  1  [get_ports {display_flat[336]}]
set_output_delay -clock clka  1  [get_ports {display_flat[335]}]
set_output_delay -clock clka  1  [get_ports {display_flat[334]}]
set_output_delay -clock clka  1  [get_ports {display_flat[333]}]
set_output_delay -clock clka  1  [get_ports {display_flat[332]}]
set_output_delay -clock clka  1  [get_ports {display_flat[331]}]
set_output_delay -clock clka  1  [get_ports {display_flat[330]}]
set_output_delay -clock clka  1  [get_ports {display_flat[329]}]
set_output_delay -clock clka  1  [get_ports {display_flat[328]}]
set_output_delay -clock clka  1  [get_ports {display_flat[327]}]
set_output_delay -clock clka  1  [get_ports {display_flat[326]}]
set_output_delay -clock clka  1  [get_ports {display_flat[325]}]
set_output_delay -clock clka  1  [get_ports {display_flat[324]}]
set_output_delay -clock clka  1  [get_ports {display_flat[323]}]
set_output_delay -clock clka  1  [get_ports {display_flat[322]}]
set_output_delay -clock clka  1  [get_ports {display_flat[321]}]
set_output_delay -clock clka  1  [get_ports {display_flat[320]}]
set_output_delay -clock clka  1  [get_ports {display_flat[319]}]
set_output_delay -clock clka  1  [get_ports {display_flat[318]}]
set_output_delay -clock clka  1  [get_ports {display_flat[317]}]
set_output_delay -clock clka  1  [get_ports {display_flat[316]}]
set_output_delay -clock clka  1  [get_ports {display_flat[315]}]
set_output_delay -clock clka  1  [get_ports {display_flat[314]}]
set_output_delay -clock clka  1  [get_ports {display_flat[313]}]
set_output_delay -clock clka  1  [get_ports {display_flat[312]}]
set_output_delay -clock clka  1  [get_ports {display_flat[311]}]
set_output_delay -clock clka  1  [get_ports {display_flat[310]}]
set_output_delay -clock clka  1  [get_ports {display_flat[309]}]
set_output_delay -clock clka  1  [get_ports {display_flat[308]}]
set_output_delay -clock clka  1  [get_ports {display_flat[307]}]
set_output_delay -clock clka  1  [get_ports {display_flat[306]}]
set_output_delay -clock clka  1  [get_ports {display_flat[305]}]
set_output_delay -clock clka  1  [get_ports {display_flat[304]}]
set_output_delay -clock clka  1  [get_ports {display_flat[303]}]
set_output_delay -clock clka  1  [get_ports {display_flat[302]}]
set_output_delay -clock clka  1  [get_ports {display_flat[301]}]
set_output_delay -clock clka  1  [get_ports {display_flat[300]}]
set_output_delay -clock clka  1  [get_ports {display_flat[299]}]
set_output_delay -clock clka  1  [get_ports {display_flat[298]}]
set_output_delay -clock clka  1  [get_ports {display_flat[297]}]
set_output_delay -clock clka  1  [get_ports {display_flat[296]}]
set_output_delay -clock clka  1  [get_ports {display_flat[295]}]
set_output_delay -clock clka  1  [get_ports {display_flat[294]}]
set_output_delay -clock clka  1  [get_ports {display_flat[293]}]
set_output_delay -clock clka  1  [get_ports {display_flat[292]}]
set_output_delay -clock clka  1  [get_ports {display_flat[291]}]
set_output_delay -clock clka  1  [get_ports {display_flat[290]}]
set_output_delay -clock clka  1  [get_ports {display_flat[289]}]
set_output_delay -clock clka  1  [get_ports {display_flat[288]}]
set_output_delay -clock clka  1  [get_ports {display_flat[287]}]
set_output_delay -clock clka  1  [get_ports {display_flat[286]}]
set_output_delay -clock clka  1  [get_ports {display_flat[285]}]
set_output_delay -clock clka  1  [get_ports {display_flat[284]}]
set_output_delay -clock clka  1  [get_ports {display_flat[283]}]
set_output_delay -clock clka  1  [get_ports {display_flat[282]}]
set_output_delay -clock clka  1  [get_ports {display_flat[281]}]
set_output_delay -clock clka  1  [get_ports {display_flat[280]}]
set_output_delay -clock clka  1  [get_ports {display_flat[279]}]
set_output_delay -clock clka  1  [get_ports {display_flat[278]}]
set_output_delay -clock clka  1  [get_ports {display_flat[277]}]
set_output_delay -clock clka  1  [get_ports {display_flat[276]}]
set_output_delay -clock clka  1  [get_ports {display_flat[275]}]
set_output_delay -clock clka  1  [get_ports {display_flat[274]}]
set_output_delay -clock clka  1  [get_ports {display_flat[273]}]
set_output_delay -clock clka  1  [get_ports {display_flat[272]}]
set_output_delay -clock clka  1  [get_ports {display_flat[271]}]
set_output_delay -clock clka  1  [get_ports {display_flat[270]}]
set_output_delay -clock clka  1  [get_ports {display_flat[269]}]
set_output_delay -clock clka  1  [get_ports {display_flat[268]}]
set_output_delay -clock clka  1  [get_ports {display_flat[267]}]
set_output_delay -clock clka  1  [get_ports {display_flat[266]}]
set_output_delay -clock clka  1  [get_ports {display_flat[265]}]
set_output_delay -clock clka  1  [get_ports {display_flat[264]}]
set_output_delay -clock clka  1  [get_ports {display_flat[263]}]
set_output_delay -clock clka  1  [get_ports {display_flat[262]}]
set_output_delay -clock clka  1  [get_ports {display_flat[261]}]
set_output_delay -clock clka  1  [get_ports {display_flat[260]}]
set_output_delay -clock clka  1  [get_ports {display_flat[259]}]
set_output_delay -clock clka  1  [get_ports {display_flat[258]}]
set_output_delay -clock clka  1  [get_ports {display_flat[257]}]
set_output_delay -clock clka  1  [get_ports {display_flat[256]}]
set_output_delay -clock clka  1  [get_ports {display_flat[255]}]
set_output_delay -clock clka  1  [get_ports {display_flat[254]}]
set_output_delay -clock clka  1  [get_ports {display_flat[253]}]
set_output_delay -clock clka  1  [get_ports {display_flat[252]}]
set_output_delay -clock clka  1  [get_ports {display_flat[251]}]
set_output_delay -clock clka  1  [get_ports {display_flat[250]}]
set_output_delay -clock clka  1  [get_ports {display_flat[249]}]
set_output_delay -clock clka  1  [get_ports {display_flat[248]}]
set_output_delay -clock clka  1  [get_ports {display_flat[247]}]
set_output_delay -clock clka  1  [get_ports {display_flat[246]}]
set_output_delay -clock clka  1  [get_ports {display_flat[245]}]
set_output_delay -clock clka  1  [get_ports {display_flat[244]}]
set_output_delay -clock clka  1  [get_ports {display_flat[243]}]
set_output_delay -clock clka  1  [get_ports {display_flat[242]}]
set_output_delay -clock clka  1  [get_ports {display_flat[241]}]
set_output_delay -clock clka  1  [get_ports {display_flat[240]}]
set_output_delay -clock clka  1  [get_ports {display_flat[239]}]
set_output_delay -clock clka  1  [get_ports {display_flat[238]}]
set_output_delay -clock clka  1  [get_ports {display_flat[237]}]
set_output_delay -clock clka  1  [get_ports {display_flat[236]}]
set_output_delay -clock clka  1  [get_ports {display_flat[235]}]
set_output_delay -clock clka  1  [get_ports {display_flat[234]}]
set_output_delay -clock clka  1  [get_ports {display_flat[233]}]
set_output_delay -clock clka  1  [get_ports {display_flat[232]}]
set_output_delay -clock clka  1  [get_ports {display_flat[231]}]
set_output_delay -clock clka  1  [get_ports {display_flat[230]}]
set_output_delay -clock clka  1  [get_ports {display_flat[229]}]
set_output_delay -clock clka  1  [get_ports {display_flat[228]}]
set_output_delay -clock clka  1  [get_ports {display_flat[227]}]
set_output_delay -clock clka  1  [get_ports {display_flat[226]}]
set_output_delay -clock clka  1  [get_ports {display_flat[225]}]
set_output_delay -clock clka  1  [get_ports {display_flat[224]}]
set_output_delay -clock clka  1  [get_ports {display_flat[223]}]
set_output_delay -clock clka  1  [get_ports {display_flat[222]}]
set_output_delay -clock clka  1  [get_ports {display_flat[221]}]
set_output_delay -clock clka  1  [get_ports {display_flat[220]}]
set_output_delay -clock clka  1  [get_ports {display_flat[219]}]
set_output_delay -clock clka  1  [get_ports {display_flat[218]}]
set_output_delay -clock clka  1  [get_ports {display_flat[217]}]
set_output_delay -clock clka  1  [get_ports {display_flat[216]}]
set_output_delay -clock clka  1  [get_ports {display_flat[215]}]
set_output_delay -clock clka  1  [get_ports {display_flat[214]}]
set_output_delay -clock clka  1  [get_ports {display_flat[213]}]
set_output_delay -clock clka  1  [get_ports {display_flat[212]}]
set_output_delay -clock clka  1  [get_ports {display_flat[211]}]
set_output_delay -clock clka  1  [get_ports {display_flat[210]}]
set_output_delay -clock clka  1  [get_ports {display_flat[209]}]
set_output_delay -clock clka  1  [get_ports {display_flat[208]}]
set_output_delay -clock clka  1  [get_ports {display_flat[207]}]
set_output_delay -clock clka  1  [get_ports {display_flat[206]}]
set_output_delay -clock clka  1  [get_ports {display_flat[205]}]
set_output_delay -clock clka  1  [get_ports {display_flat[204]}]
set_output_delay -clock clka  1  [get_ports {display_flat[203]}]
set_output_delay -clock clka  1  [get_ports {display_flat[202]}]
set_output_delay -clock clka  1  [get_ports {display_flat[201]}]
set_output_delay -clock clka  1  [get_ports {display_flat[200]}]
set_output_delay -clock clka  1  [get_ports {display_flat[199]}]
set_output_delay -clock clka  1  [get_ports {display_flat[198]}]
set_output_delay -clock clka  1  [get_ports {display_flat[197]}]
set_output_delay -clock clka  1  [get_ports {display_flat[196]}]
set_output_delay -clock clka  1  [get_ports {display_flat[195]}]
set_output_delay -clock clka  1  [get_ports {display_flat[194]}]
set_output_delay -clock clka  1  [get_ports {display_flat[193]}]
set_output_delay -clock clka  1  [get_ports {display_flat[192]}]
set_output_delay -clock clka  1  [get_ports {display_flat[191]}]
set_output_delay -clock clka  1  [get_ports {display_flat[190]}]
set_output_delay -clock clka  1  [get_ports {display_flat[189]}]
set_output_delay -clock clka  1  [get_ports {display_flat[188]}]
set_output_delay -clock clka  1  [get_ports {display_flat[187]}]
set_output_delay -clock clka  1  [get_ports {display_flat[186]}]
set_output_delay -clock clka  1  [get_ports {display_flat[185]}]
set_output_delay -clock clka  1  [get_ports {display_flat[184]}]
set_output_delay -clock clka  1  [get_ports {display_flat[183]}]
set_output_delay -clock clka  1  [get_ports {display_flat[182]}]
set_output_delay -clock clka  1  [get_ports {display_flat[181]}]
set_output_delay -clock clka  1  [get_ports {display_flat[180]}]
set_output_delay -clock clka  1  [get_ports {display_flat[179]}]
set_output_delay -clock clka  1  [get_ports {display_flat[178]}]
set_output_delay -clock clka  1  [get_ports {display_flat[177]}]
set_output_delay -clock clka  1  [get_ports {display_flat[176]}]
set_output_delay -clock clka  1  [get_ports {display_flat[175]}]
set_output_delay -clock clka  1  [get_ports {display_flat[174]}]
set_output_delay -clock clka  1  [get_ports {display_flat[173]}]
set_output_delay -clock clka  1  [get_ports {display_flat[172]}]
set_output_delay -clock clka  1  [get_ports {display_flat[171]}]
set_output_delay -clock clka  1  [get_ports {display_flat[170]}]
set_output_delay -clock clka  1  [get_ports {display_flat[169]}]
set_output_delay -clock clka  1  [get_ports {display_flat[168]}]
set_output_delay -clock clka  1  [get_ports {display_flat[167]}]
set_output_delay -clock clka  1  [get_ports {display_flat[166]}]
set_output_delay -clock clka  1  [get_ports {display_flat[165]}]
set_output_delay -clock clka  1  [get_ports {display_flat[164]}]
set_output_delay -clock clka  1  [get_ports {display_flat[163]}]
set_output_delay -clock clka  1  [get_ports {display_flat[162]}]
set_output_delay -clock clka  1  [get_ports {display_flat[161]}]
set_output_delay -clock clka  1  [get_ports {display_flat[160]}]
set_output_delay -clock clka  1  [get_ports {display_flat[159]}]
set_output_delay -clock clka  1  [get_ports {display_flat[158]}]
set_output_delay -clock clka  1  [get_ports {display_flat[157]}]
set_output_delay -clock clka  1  [get_ports {display_flat[156]}]
set_output_delay -clock clka  1  [get_ports {display_flat[155]}]
set_output_delay -clock clka  1  [get_ports {display_flat[154]}]
set_output_delay -clock clka  1  [get_ports {display_flat[153]}]
set_output_delay -clock clka  1  [get_ports {display_flat[152]}]
set_output_delay -clock clka  1  [get_ports {display_flat[151]}]
set_output_delay -clock clka  1  [get_ports {display_flat[150]}]
set_output_delay -clock clka  1  [get_ports {display_flat[149]}]
set_output_delay -clock clka  1  [get_ports {display_flat[148]}]
set_output_delay -clock clka  1  [get_ports {display_flat[147]}]
set_output_delay -clock clka  1  [get_ports {display_flat[146]}]
set_output_delay -clock clka  1  [get_ports {display_flat[145]}]
set_output_delay -clock clka  1  [get_ports {display_flat[144]}]
set_output_delay -clock clka  1  [get_ports {display_flat[143]}]
set_output_delay -clock clka  1  [get_ports {display_flat[142]}]
set_output_delay -clock clka  1  [get_ports {display_flat[141]}]
set_output_delay -clock clka  1  [get_ports {display_flat[140]}]
set_output_delay -clock clka  1  [get_ports {display_flat[139]}]
set_output_delay -clock clka  1  [get_ports {display_flat[138]}]
set_output_delay -clock clka  1  [get_ports {display_flat[137]}]
set_output_delay -clock clka  1  [get_ports {display_flat[136]}]
set_output_delay -clock clka  1  [get_ports {display_flat[135]}]
set_output_delay -clock clka  1  [get_ports {display_flat[134]}]
set_output_delay -clock clka  1  [get_ports {display_flat[133]}]
set_output_delay -clock clka  1  [get_ports {display_flat[132]}]
set_output_delay -clock clka  1  [get_ports {display_flat[131]}]
set_output_delay -clock clka  1  [get_ports {display_flat[130]}]
set_output_delay -clock clka  1  [get_ports {display_flat[129]}]
set_output_delay -clock clka  1  [get_ports {display_flat[128]}]
set_output_delay -clock clka  1  [get_ports {display_flat[127]}]
set_output_delay -clock clka  1  [get_ports {display_flat[126]}]
set_output_delay -clock clka  1  [get_ports {display_flat[125]}]
set_output_delay -clock clka  1  [get_ports {display_flat[124]}]
set_output_delay -clock clka  1  [get_ports {display_flat[123]}]
set_output_delay -clock clka  1  [get_ports {display_flat[122]}]
set_output_delay -clock clka  1  [get_ports {display_flat[121]}]
set_output_delay -clock clka  1  [get_ports {display_flat[120]}]
set_output_delay -clock clka  1  [get_ports {display_flat[119]}]
set_output_delay -clock clka  1  [get_ports {display_flat[118]}]
set_output_delay -clock clka  1  [get_ports {display_flat[117]}]
set_output_delay -clock clka  1  [get_ports {display_flat[116]}]
set_output_delay -clock clka  1  [get_ports {display_flat[115]}]
set_output_delay -clock clka  1  [get_ports {display_flat[114]}]
set_output_delay -clock clka  1  [get_ports {display_flat[113]}]
set_output_delay -clock clka  1  [get_ports {display_flat[112]}]
set_output_delay -clock clka  1  [get_ports {display_flat[111]}]
set_output_delay -clock clka  1  [get_ports {display_flat[110]}]
set_output_delay -clock clka  1  [get_ports {display_flat[109]}]
set_output_delay -clock clka  1  [get_ports {display_flat[108]}]
set_output_delay -clock clka  1  [get_ports {display_flat[107]}]
set_output_delay -clock clka  1  [get_ports {display_flat[106]}]
set_output_delay -clock clka  1  [get_ports {display_flat[105]}]
set_output_delay -clock clka  1  [get_ports {display_flat[104]}]
set_output_delay -clock clka  1  [get_ports {display_flat[103]}]
set_output_delay -clock clka  1  [get_ports {display_flat[102]}]
set_output_delay -clock clka  1  [get_ports {display_flat[101]}]
set_output_delay -clock clka  1  [get_ports {display_flat[100]}]
set_output_delay -clock clka  1  [get_ports {display_flat[99]}]
set_output_delay -clock clka  1  [get_ports {display_flat[98]}]
set_output_delay -clock clka  1  [get_ports {display_flat[97]}]
set_output_delay -clock clka  1  [get_ports {display_flat[96]}]
set_output_delay -clock clka  1  [get_ports {display_flat[95]}]
set_output_delay -clock clka  1  [get_ports {display_flat[94]}]
set_output_delay -clock clka  1  [get_ports {display_flat[93]}]
set_output_delay -clock clka  1  [get_ports {display_flat[92]}]
set_output_delay -clock clka  1  [get_ports {display_flat[91]}]
set_output_delay -clock clka  1  [get_ports {display_flat[90]}]
set_output_delay -clock clka  1  [get_ports {display_flat[89]}]
set_output_delay -clock clka  1  [get_ports {display_flat[88]}]
set_output_delay -clock clka  1  [get_ports {display_flat[87]}]
set_output_delay -clock clka  1  [get_ports {display_flat[86]}]
set_output_delay -clock clka  1  [get_ports {display_flat[85]}]
set_output_delay -clock clka  1  [get_ports {display_flat[84]}]
set_output_delay -clock clka  1  [get_ports {display_flat[83]}]
set_output_delay -clock clka  1  [get_ports {display_flat[82]}]
set_output_delay -clock clka  1  [get_ports {display_flat[81]}]
set_output_delay -clock clka  1  [get_ports {display_flat[80]}]
set_output_delay -clock clka  1  [get_ports {display_flat[79]}]
set_output_delay -clock clka  1  [get_ports {display_flat[78]}]
set_output_delay -clock clka  1  [get_ports {display_flat[77]}]
set_output_delay -clock clka  1  [get_ports {display_flat[76]}]
set_output_delay -clock clka  1  [get_ports {display_flat[75]}]
set_output_delay -clock clka  1  [get_ports {display_flat[74]}]
set_output_delay -clock clka  1  [get_ports {display_flat[73]}]
set_output_delay -clock clka  1  [get_ports {display_flat[72]}]
set_output_delay -clock clka  1  [get_ports {display_flat[71]}]
set_output_delay -clock clka  1  [get_ports {display_flat[70]}]
set_output_delay -clock clka  1  [get_ports {display_flat[69]}]
set_output_delay -clock clka  1  [get_ports {display_flat[68]}]
set_output_delay -clock clka  1  [get_ports {display_flat[67]}]
set_output_delay -clock clka  1  [get_ports {display_flat[66]}]
set_output_delay -clock clka  1  [get_ports {display_flat[65]}]
set_output_delay -clock clka  1  [get_ports {display_flat[64]}]
set_output_delay -clock clka  1  [get_ports {display_flat[63]}]
set_output_delay -clock clka  1  [get_ports {display_flat[62]}]
set_output_delay -clock clka  1  [get_ports {display_flat[61]}]
set_output_delay -clock clka  1  [get_ports {display_flat[60]}]
set_output_delay -clock clka  1  [get_ports {display_flat[59]}]
set_output_delay -clock clka  1  [get_ports {display_flat[58]}]
set_output_delay -clock clka  1  [get_ports {display_flat[57]}]
set_output_delay -clock clka  1  [get_ports {display_flat[56]}]
set_output_delay -clock clka  1  [get_ports {display_flat[55]}]
set_output_delay -clock clka  1  [get_ports {display_flat[54]}]
set_output_delay -clock clka  1  [get_ports {display_flat[53]}]
set_output_delay -clock clka  1  [get_ports {display_flat[52]}]
set_output_delay -clock clka  1  [get_ports {display_flat[51]}]
set_output_delay -clock clka  1  [get_ports {display_flat[50]}]
set_output_delay -clock clka  1  [get_ports {display_flat[49]}]
set_output_delay -clock clka  1  [get_ports {display_flat[48]}]
set_output_delay -clock clka  1  [get_ports {display_flat[47]}]
set_output_delay -clock clka  1  [get_ports {display_flat[46]}]
set_output_delay -clock clka  1  [get_ports {display_flat[45]}]
set_output_delay -clock clka  1  [get_ports {display_flat[44]}]
set_output_delay -clock clka  1  [get_ports {display_flat[43]}]
set_output_delay -clock clka  1  [get_ports {display_flat[42]}]
set_output_delay -clock clka  1  [get_ports {display_flat[41]}]
set_output_delay -clock clka  1  [get_ports {display_flat[40]}]
set_output_delay -clock clka  1  [get_ports {display_flat[39]}]
set_output_delay -clock clka  1  [get_ports {display_flat[38]}]
set_output_delay -clock clka  1  [get_ports {display_flat[37]}]
set_output_delay -clock clka  1  [get_ports {display_flat[36]}]
set_output_delay -clock clka  1  [get_ports {display_flat[35]}]
set_output_delay -clock clka  1  [get_ports {display_flat[34]}]
set_output_delay -clock clka  1  [get_ports {display_flat[33]}]
set_output_delay -clock clka  1  [get_ports {display_flat[32]}]
set_output_delay -clock clka  1  [get_ports {display_flat[31]}]
set_output_delay -clock clka  1  [get_ports {display_flat[30]}]
set_output_delay -clock clka  1  [get_ports {display_flat[29]}]
set_output_delay -clock clka  1  [get_ports {display_flat[28]}]
set_output_delay -clock clka  1  [get_ports {display_flat[27]}]
set_output_delay -clock clka  1  [get_ports {display_flat[26]}]
set_output_delay -clock clka  1  [get_ports {display_flat[25]}]
set_output_delay -clock clka  1  [get_ports {display_flat[24]}]
set_output_delay -clock clka  1  [get_ports {display_flat[23]}]
set_output_delay -clock clka  1  [get_ports {display_flat[22]}]
set_output_delay -clock clka  1  [get_ports {display_flat[21]}]
set_output_delay -clock clka  1  [get_ports {display_flat[20]}]
set_output_delay -clock clka  1  [get_ports {display_flat[19]}]
set_output_delay -clock clka  1  [get_ports {display_flat[18]}]
set_output_delay -clock clka  1  [get_ports {display_flat[17]}]
set_output_delay -clock clka  1  [get_ports {display_flat[16]}]
set_output_delay -clock clka  1  [get_ports {display_flat[15]}]
set_output_delay -clock clka  1  [get_ports {display_flat[14]}]
set_output_delay -clock clka  1  [get_ports {display_flat[13]}]
set_output_delay -clock clka  1  [get_ports {display_flat[12]}]
set_output_delay -clock clka  1  [get_ports {display_flat[11]}]
set_output_delay -clock clka  1  [get_ports {display_flat[10]}]
set_output_delay -clock clka  1  [get_ports {display_flat[9]}]
set_output_delay -clock clka  1  [get_ports {display_flat[8]}]
set_output_delay -clock clka  1  [get_ports {display_flat[7]}]
set_output_delay -clock clka  1  [get_ports {display_flat[6]}]
set_output_delay -clock clka  1  [get_ports {display_flat[5]}]
set_output_delay -clock clka  1  [get_ports {display_flat[4]}]
set_output_delay -clock clka  1  [get_ports {display_flat[3]}]
set_output_delay -clock clka  1  [get_ports {display_flat[2]}]
set_output_delay -clock clka  1  [get_ports {display_flat[1]}]
set_output_delay -clock clka  1  [get_ports {display_flat[0]}]
set_output_delay -clock clka  1  [get_ports play]
set_output_delay -clock clka  1  [get_ports internal_reset]
set_output_delay -clock clka  1  [get_ports {player_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {player_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {player_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {player_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {player_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {player_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {player_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {player_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {player_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {player_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {player_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {player_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports player_display]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {invader_1_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports invader_1_display]
set_output_delay -clock clka  1  [get_ports playerbullet_invader_collision_signal_1]
set_output_delay -clock clka  1  [get_ports invader_outofbounds_signal_1]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {invader_2_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports invader_2_display]
set_output_delay -clock clka  1  [get_ports playerbullet_invader_collision_signal_2]
set_output_delay -clock clka  1  [get_ports invader_outofbounds_signal_2]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {invader_3_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports invader_3_display]
set_output_delay -clock clka  1  [get_ports playerbullet_invader_collision_signal_3]
set_output_delay -clock clka  1  [get_ports invader_outofbounds_signal_3]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {invader_4_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports invader_4_display]
set_output_delay -clock clka  1  [get_ports playerbullet_invader_collision_signal_4]
set_output_delay -clock clka  1  [get_ports invader_outofbounds_signal_4]
set_output_delay -clock clka  1  [get_ports {shield_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {shield_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports {shield_hp[1]}]
set_output_delay -clock clka  1  [get_ports {shield_hp[0]}]
set_output_delay -clock clka  1  [get_ports shield_display]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {player_bullet_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports player_bullet_display]
set_output_delay -clock clka  1  [get_ports player_left_motion]
set_output_delay -clock clka  1  [get_ports player_right_motion]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {invader_bullet_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports invader_bullet_display]
set_output_delay -clock clka  1  [get_ports invader_direction]
set_output_delay -clock clka  1  [get_ports move_down]
set_output_delay -clock clka  1  [get_ports invaderbullet_player_collision_signal]
set_output_delay -clock clka  1  [get_ports invaderbullet_shield_collision_signal]
set_output_delay -clock clka  1  [get_ports playerbullet_shield_collision_signal]
set_output_delay -clock clka  1  [get_ports invader_fire]
set_output_delay -clock clka  1  [get_ports playerbullet_fire]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_x[5]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_x[4]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_x[3]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_x[2]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_x[1]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_x[0]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_y[5]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_y[4]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_y[3]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_y[2]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_y[1]}]
set_output_delay -clock clka  1  [get_ports {closest_invader_coord_y[0]}]
set_output_delay -clock clka  1  [get_ports player_bullet_collision]
set_output_delay -clock clka  1  [get_ports {invaders_display[3]}]
set_output_delay -clock clka  1  [get_ports {invaders_display[2]}]
set_output_delay -clock clka  1  [get_ports {invaders_display[1]}]
set_output_delay -clock clka  1  [get_ports {invaders_display[0]}]
set_output_delay -clock clka  1  [get_ports playerbullet_invader_collision_signal]
set_output_delay -clock clka  1  [get_ports {invader_state_1[1]}]
set_output_delay -clock clka  1  [get_ports {invader_state_1[0]}]
set_output_delay -clock clka  1  [get_ports {invader_state_2[1]}]
set_output_delay -clock clka  1  [get_ports {invader_state_2[0]}]
set_output_delay -clock clka  1  [get_ports {invader_state_3[1]}]
set_output_delay -clock clka  1  [get_ports {invader_state_3[0]}]
set_output_delay -clock clka  1  [get_ports {invader_state_4[1]}]
set_output_delay -clock clka  1  [get_ports {invader_state_4[0]}]
set_output_delay -clock clka  1  [get_ports {player_state[1]}]
set_output_delay -clock clka  1  [get_ports {player_state[0]}]
set_output_delay -clock clka  1  [get_ports {playerbullet_state[1]}]
set_output_delay -clock clka  1  [get_ports {playerbullet_state[0]}]
set_output_delay -clock clka  1  [get_ports {invaderbullet_state[1]}]
set_output_delay -clock clka  1  [get_ports {invaderbullet_state[0]}]
